{
  "experience": [
    {
      "label": "Menü Yönetim Performans İyileştirmesi",
      "detail": "Projede, bayilerin menülerini yönetebilmelerine, ürünleri düzenleyip güncelleyebilmelerine, aynı zamanda toplu menu güncellemelerini gerçekleştirebilmelerine olanak tanıyan bir platform geliştirilmiştir. Teknoloji olarak Typescript ile birlikte React.JS kullanıldı. State yönetimi için Context API ve Redux Toolkit tercih edildi. UI tarafında Material UI kütüphanesi kullanıldı. Projeye başladığımda, performans sorunları projenin en büyük zorluklarından biriydi. Bu nedenle, bundle boyutunu %63 oranında küçülterek projenin yüklenme hızını artırmak için yoğun çalışmalar yürüttüm. Ayrıca, bayilerin menüleri ve ürünleri düzenlemesini kolaylaştıran yeni özellikler ekleyerek projenin kullanıcı deneyimini geliştirdim. Sonuç olarak, projenin daha hızlı ve verimli çalışmasını sağladım ve kullanıcıların daha rahat bir şekilde menüleri yönetmelerine yardımcı oldum."
    },
    {
      "label": "Openin Times Plugin",
      "detail": "Projede, bayilerin restoranlarının haftalık çalışma saatlerini düzenleyebilmelerine olanak tanıyan bir platform geliştirmeyi amaçladı. Ayrıca, özel günlerde alternatif çalışma saatleri ayarlayabilmelerine ve ani durumlarda, örneğin ölüm, siparişi tedariği veya motorlu kuryesinin eksik olduğu durumlarda çalışma saatlerini geçici olarak durdurabilmelerine olanak sağlayacak özellikler ekledik. Teknoloji olarak React.JS ve Typescript kullanıldı ve state yönetimi için Context API tercih edildi. UI tarafında Material UI ve styled components kullanıldı. Projenin başlangıcında sıfırdan yazıldı ve bu sayede projenin her aşamasında etkin bir rol oynadım. Ayrıca, geliştirilen her bileşenin testleri React Testing Library ile yazıldı. Bu projede, kullanıcıların restoranlarının çalışma saatlerini daha esnek bir şekilde yönetmelerine olanak sağlayarak, restoranlar için iş sürekliliğini artırmalarına yardımcı olduk. Aynı zamanda, özel günlerde ve beklenmedik durumlarda hızlı ve etkili bir şekilde çalışma saatlerini ayarlamalarına yardımcı olan bu projenin kullanıcı dostu arayüzü ile kullanıcıların işlerini daha verimli bir şekilde yönetmelerini sağladık."
    },
    {
      "label": "Settings Plugin",
      "detail": "Projede, bayilerin restoranlarının iletişim bilgilerini düzenlemelerine, restoran adreslerini güncellemelerine, fatura adreslerini değiştirmelerine ve diğer bayilerin bilgilerine yetki listesine göre işlem yapmalarına olanak sağlayan bir platform geliştirildi. Teknoloji olarak React.JS ve Typescript kullanıldı ve state yönetimi için Context API tercih edildi. UI tarafında Material UI ve styled components kullanıldı. Projeye başladığımda, proje sıfırdan yazılıyordu ve bu nedenle projenin tüm aşamalarında aktif bir rol oynadım. Her bir bileşenin testleri, React Testing Library ile yazıldı. Bu projede, bayilerin restoran bilgilerini daha iyi yönetmelerine ve gerektiğinde hızlı ve kolay bir şekilde güncellemelerine olanak sağlayan bir platform geliştirdik. Aynı zamanda, yetki listelerine dayalı olarak bayilerin bilgilere erişimini düzenlemelerine olanak sağlayarak veri güvenliğini artırdık. Kullanıcı dostu arayüzümüz sayesinde, bayilerin bu işlemleri kolayca gerçekleştirmelerini sağladık."
    },
    {
      "label": "Delivery Areas Plugin",
      "detail": "Projede, bayilerin hangi bölgelere dağıtım yapabileceklerini seçebilmelerine, teslimat ücretlerini girebilmelerine, bölgeleri ayrıntılı olarak, mahalle, cadde ve sokak düzeyinde ayırabilmelerine ve istedikleri zaman teslimat bölgelerini kapatabilmelerine olanak tanıyan bir platform geliştirdik. Teknoloji olarak React.JS ve Typescript kullanıldı ve state yönetimi için Context API tercih edildi. UI tarafında Material UI ve styled components kullanıldı. Proje sıfırdan başlatıldı ve bu nedenle projenin her aşamasında etkin bir şekilde yer aldım. Tüm bileşenlerin testleri, React Testing Library ile yazıldı. Bu projede, bayilerin teslimat bölgelerini daha iyi yönetmelerine ve hızlı bir şekilde değiştirebilmelerine olanak tanıyan bir platform geliştirdik. Ayrıca, bölgeleri ayrıntılı olarak ayırma yeteneği sayesinde bayilerin daha esnek bir şekilde çalışmalarını sağladık. Bu, bayilerin müşteri hizmetlerini ve teslimat süreçlerini daha iyi yönetmelerine yardımcı oldu."
    },
    {
      "label": "Payment Method Plugin",
      "detail": "Projede, bayilerin hangi ödeme yöntemlerini kullanacaklarını yönetebilmelerine ve bu ödeme yöntemlerini diledikleri gibi değiştirebilmelerine olanak tanıyan bir platform geliştirdik. Proje sıfırdan başladı ve projenin her aşamasında aktif bir rol oynadım. Teknoloji olarak React.JS ve Typescript kullanıldı, state yönetimi için Context API tercih edildi, ve UI tarafında Material UI ve styled components kullanıldı. Bu projede, bayilerin ödeme yöntemlerini esnek bir şekilde yönetmelerine ve iş gereksinimlerine göre ödeme seçeneklerini ayarlayabilmelerine olanak tanıyan bir platform geliştirdik. Bu, bayilere ödeme işlemlerini daha iyi kontrol etme ve yönetme fırsatı sağladı."
    },
    {
      "label": "New Menu Management Plugin",
      "detail": "Proje, restoranların menülerini yönetebilmeleri için kapsamlı bir altyapı oluşturmayı amaçlayan bir girişimdir. Projenin başlangıcında, menü fotoğraflarının yapay zeka destekli bir şekilde çalışmasını sağlama ve projeyi global bir plugin haline getirme hedefleri vardır. Teknoloji yelpazesi, React.JS ve Typescript ile başlamakta, state yönetimi için Redux Toolkit kullanılmakta ve UI tarafında Material UI ve styled components tercih edilmektedir. Bu projenin benzersizliği, restoranlar için menü yönetimini daha etkili hale getirecek bir yapay zeka entegrasyonunun planlanmasıdır. Bu, menü öğelerini ve fotoğraflarını otomatik olarak tanımlayarak, restoran sahiplerine menülerini daha hızlı güncelleme olanağı sunar. Projeye başladığımda, projenin altyapısının oluşturulması ve geleceğe dönük adımların atılması aşamasında yer aldım. Projeyi global bir plugin haline getirmek için gereken kararların tartışılmasında ve geliştirilmesinde etkin bir rol oynadım. Halen proje üzerinde çalışmaya devam ediyorum ve yapay zeka destekli fotoğraf işleme özelliğinin geliştirilmesine katkıda bulunuyorum. Bu projede, restoranlar için menü yönetimini daha verimli hale getirerek işlerini daha iyi yönetmelerine yardımcı oluyoruz. Ayrıca, menü fotoğraflarının yapay zeka ile işlenmesi, restoran sahiplerine menülerini daha hızlı güncelleme ve düzenleme imkanı sunuyor. Projeyi global bir plugin haline getirme hedefimiz, bu özellikleri daha geniş bir kullanıcı kitlesine ulaştırarak restoranlar için büyük bir avantaj sağlamaktadır."
    }
  ]
}
