{
  "tr": {
    "experience": [
      {
        "label": "Menü Yönetim Performans İyileştirmesi",
        "detail": "Projede, bayilerin menülerini yönetebilmelerine, ürünleri düzenleyip güncelleyebilmelerine, aynı zamanda toplu menu güncellemelerini gerçekleştirebilmelerine olanak tanıyan bir platform geliştirilmiştir. Teknoloji olarak Typescript ile birlikte React.JS kullanıldı. State yönetimi için Context API ve Redux Toolkit tercih edildi. UI tarafında Material UI kütüphanesi kullanıldı. Projeye başladığımda, performans sorunları projenin en büyük zorluklarından biriydi. Bu nedenle, bundle boyutunu %63 oranında küçülterek projenin yüklenme hızını artırmak için yoğun çalışmalar yürüttüm. Ayrıca, bayilerin menüleri ve ürünleri düzenlemesini kolaylaştıran yeni özellikler ekleyerek projenin kullanıcı deneyimini geliştirdim. Sonuç olarak, projenin daha hızlı ve verimli çalışmasını sağladım ve kullanıcıların daha rahat bir şekilde menüleri yönetmelerine yardımcı oldum."
      },
      {
        "label": "Openin Times Plugin",
        "detail": "Projede, bayilerin restoranlarının haftalık çalışma saatlerini düzenleyebilmelerine olanak tanıyan bir platform geliştirmeyi amaçladı. Ayrıca, özel günlerde alternatif çalışma saatleri ayarlayabilmelerine ve ani durumlarda, örneğin ölüm, siparişi tedariği veya motorlu kuryesinin eksik olduğu durumlarda çalışma saatlerini geçici olarak durdurabilmelerine olanak sağlayacak özellikler ekledik. Teknoloji olarak React.JS ve Typescript kullanıldı ve state yönetimi için Context API tercih edildi. UI tarafında Material UI ve styled components kullanıldı. Projenin başlangıcında sıfırdan yazıldı ve bu sayede projenin her aşamasında etkin bir rol oynadım. Ayrıca, geliştirilen her bileşenin testleri React Testing Library ile yazıldı. Bu projede, kullanıcıların restoranlarının çalışma saatlerini daha esnek bir şekilde yönetmelerine olanak sağlayarak, restoranlar için iş sürekliliğini artırmalarına yardımcı olduk. Aynı zamanda, özel günlerde ve beklenmedik durumlarda hızlı ve etkili bir şekilde çalışma saatlerini ayarlamalarına yardımcı olan bu projenin kullanıcı dostu arayüzü ile kullanıcıların işlerini daha verimli bir şekilde yönetmelerini sağladık."
      },
      {
        "label": "Settings Plugin",
        "detail": "Projede, bayilerin restoranlarının iletişim bilgilerini düzenlemelerine, restoran adreslerini güncellemelerine, fatura adreslerini değiştirmelerine ve diğer bayilerin bilgilerine yetki listesine göre işlem yapmalarına olanak sağlayan bir platform geliştirildi. Teknoloji olarak React.JS ve Typescript kullanıldı ve state yönetimi için Context API tercih edildi. UI tarafında Material UI ve styled components kullanıldı. Projeye başladığımda, proje sıfırdan yazılıyordu ve bu nedenle projenin tüm aşamalarında aktif bir rol oynadım. Her bir bileşenin testleri, React Testing Library ile yazıldı. Bu projede, bayilerin restoran bilgilerini daha iyi yönetmelerine ve gerektiğinde hızlı ve kolay bir şekilde güncellemelerine olanak sağlayan bir platform geliştirdik. Aynı zamanda, yetki listelerine dayalı olarak bayilerin bilgilere erişimini düzenlemelerine olanak sağlayarak veri güvenliğini artırdık. Kullanıcı dostu arayüzümüz sayesinde, bayilerin bu işlemleri kolayca gerçekleştirmelerini sağladık."
      },
      {
        "label": "Delivery Areas Plugin",
        "detail": "Projede, bayilerin hangi bölgelere dağıtım yapabileceklerini seçebilmelerine, teslimat ücretlerini girebilmelerine, bölgeleri ayrıntılı olarak, mahalle, cadde ve sokak düzeyinde ayırabilmelerine ve istedikleri zaman teslimat bölgelerini kapatabilmelerine olanak tanıyan bir platform geliştirdik. Teknoloji olarak React.JS ve Typescript kullanıldı ve state yönetimi için Context API tercih edildi. UI tarafında Material UI ve styled components kullanıldı. Proje sıfırdan başlatıldı ve bu nedenle projenin her aşamasında etkin bir şekilde yer aldım. Tüm bileşenlerin testleri, React Testing Library ile yazıldı. Bu projede, bayilerin teslimat bölgelerini daha iyi yönetmelerine ve hızlı bir şekilde değiştirebilmelerine olanak tanıyan bir platform geliştirdik. Ayrıca, bölgeleri ayrıntılı olarak ayırma yeteneği sayesinde bayilerin daha esnek bir şekilde çalışmalarını sağladık. Bu, bayilerin müşteri hizmetlerini ve teslimat süreçlerini daha iyi yönetmelerine yardımcı oldu."
      },
      {
        "label": "Payment Method Plugin",
        "detail": "Projede, bayilerin hangi ödeme yöntemlerini kullanacaklarını yönetebilmelerine ve bu ödeme yöntemlerini diledikleri gibi değiştirebilmelerine olanak tanıyan bir platform geliştirdik. Proje sıfırdan başladı ve projenin her aşamasında aktif bir rol oynadım. Teknoloji olarak React.JS ve Typescript kullanıldı, state yönetimi için Context API tercih edildi, ve UI tarafında Material UI ve styled components kullanıldı. Bu projede, bayilerin ödeme yöntemlerini esnek bir şekilde yönetmelerine ve iş gereksinimlerine göre ödeme seçeneklerini ayarlayabilmelerine olanak tanıyan bir platform geliştirdik. Bu, bayilere ödeme işlemlerini daha iyi kontrol etme ve yönetme fırsatı sağladı."
      },
      {
        "label": "New Menu Management Plugin",
        "detail": "Proje, restoranların menülerini yönetebilmeleri için kapsamlı bir altyapı oluşturmayı amaçlayan bir girişimdir. Projenin başlangıcında, menü fotoğraflarının yapay zeka destekli bir şekilde çalışmasını sağlama ve projeyi global bir plugin haline getirme hedefleri vardır. Teknoloji yelpazesi, React.JS ve Typescript ile başlamakta, state yönetimi için Redux Toolkit kullanılmakta ve UI tarafında Material UI ve styled components tercih edilmektedir. Bu projenin benzersizliği, restoranlar için menü yönetimini daha etkili hale getirecek bir yapay zeka entegrasyonunun planlanmasıdır. Bu, menü öğelerini ve fotoğraflarını otomatik olarak tanımlayarak, restoran sahiplerine menülerini daha hızlı güncelleme olanağı sunar. Projeye başladığımda, projenin altyapısının oluşturulması ve geleceğe dönük adımların atılması aşamasında yer aldım. Projeyi global bir plugin haline getirmek için gereken kararların tartışılmasında ve geliştirilmesinde etkin bir rol oynadım. Halen proje üzerinde çalışmaya devam ediyorum ve yapay zeka destekli fotoğraf işleme özelliğinin geliştirilmesine katkıda bulunuyorum. Bu projede, restoranlar için menü yönetimini daha verimli hale getirerek işlerini daha iyi yönetmelerine yardımcı oluyoruz. Ayrıca, menü fotoğraflarının yapay zeka ile işlenmesi, restoran sahiplerine menülerini daha hızlı güncelleme ve düzenleme imkanı sunuyor. Projeyi global bir plugin haline getirme hedefimiz, bu özellikleri daha geniş bir kullanıcı kitlesine ulaştırarak restoranlar için büyük bir avantaj sağlamaktadır."
      }
    ]
  },

  "en": {
    "experience": [
      {
        "label": "Menu Management Performance Improvement",
        "detail": "In the project, a platform was developed that allows dealers to manage their menus, edit and update products, and also perform bulk menu updates. Technology-wise, TypeScript along with React.JS was used. For state management, Context API and Redux Toolkit were preferred. Material UI library was used for the UI. When I started the project, performance issues were one of the biggest challenges. Therefore, I conducted intensive work to reduce the bundle size by 63% to increase the project's loading speed. Additionally, I improved the user experience of the project by adding new features that make it easier for dealers to edit menus and products. As a result, I made the project work faster and more efficiently, helping users manage menus more comfortably."
      },
      {
        "label": "Opening Times Plugin",
        "detail": "The project aimed to develop a platform that allows dealers to edit their restaurants' weekly working hours. In addition, we added features that allow them to set alternative working hours on special days and temporarily stop working hours in case of emergencies, such as death, supply order, or a shortage of motorbike couriers. Technology-wise, we used React.JS and TypeScript, and preferred Context API for state management. Material UI and styled components were used for the UI. The project was started from scratch, and I played an active role in every stage of the project. We also wrote tests for each component using React Testing Library. In this project, we helped users improve the continuity of work for restaurants by allowing them to manage their restaurant's working hours more flexibly. Moreover, with the user-friendly interface of this project, we enabled users to manage their work more efficiently by quickly and effectively adjusting working hours on special days and unexpected situations."
      },
      {
        "label": "Settings Plugin",
        "detail": "In the project, a platform was developed that allows dealers to edit their restaurant's contact information, update restaurant addresses, change billing addresses, and perform operations on other dealers' information based on authorization lists. Technology-wise, React.JS and TypeScript were used, and Context API was preferred for state management. Material UI and styled components were used for the UI. When I started the project, it was being written from scratch, and that's why I played an active role in every stage of the project. Tests for each component were written using React Testing Library. In this project, we developed a platform that allows dealers to better manage their restaurant information and update it quickly and easily when needed. Additionally, we enhanced data security by allowing dealers to access information based on authorization lists. Thanks to our user-friendly interface, we made it easy for dealers to perform these operations."
      },
      {
        "label": "Delivery Areas Plugin",
        "detail": "In the project, we developed a platform that allows dealers to choose the areas to which they can make deliveries, enter delivery fees, divide areas in detail, down to the neighborhood, street, and lane level, and enable them to close delivery areas whenever they want. Technology-wise, we used React.JS and TypeScript, and preferred Context API for state management. Material UI and styled components were used for the UI. The project was started from scratch, and that's why I played an active role in every stage of the project. Tests for all components were written using React Testing Library. In this project, we developed a platform that allows dealers to better manage their delivery areas and change them quickly. Additionally, the ability to divide areas in detail allowed dealers to work more flexibly. This helped dealers manage their customer services and delivery processes more effectively."
      },
      {
        "label": "Payment Method Plugin",
        "detail": "In the project, we developed a platform that allows dealers to manage which payment methods they will use and change these payment methods as they wish. The project started from scratch, and I played an active role in every stage of the project. Technology-wise, we used React.JS and TypeScript, preferred Context API for state management, and used Material UI and styled components for the UI. In this project, we developed a platform that allows dealers to manage payment methods flexibly and adjust payment options according to business requirements. This provided dealers with the opportunity to control and manage payment transactions more effectively."
      },
      {
        "label": "New Menu Management Plugin",
        "detail": "The project is an initiative to create a comprehensive infrastructure for restaurants to manage their menus. At the beginning of the project, there are goals to make menu photos work with artificial intelligence and to make the project a global plugin. The technology stack starts with React.JS and TypeScript, Redux Toolkit is used for state management, and Material UI and styled components are preferred for the UI. The uniqueness of this project is the planning of artificial intelligence integration that will make menu management more effective for restaurants. This automatically identifies menu items and photos, allowing restaurant owners to update menus more quickly. When I started the project, I was involved in creating the project's infrastructure and taking future steps. I played an active role in discussing and developing the decisions needed to turn the project into a global plugin. I am still working on the project and contributing to the development of the artificial intelligence-supported photo processing feature. In this project, we help restaurants manage menu management more efficiently, enabling them to better manage their businesses. In addition, the integration of menu photos with artificial intelligence offers restaurant owners the opportunity to update and edit their menus more quickly. Our goal in turning the project into a global plugin provides significant advantages to restaurants by reaching a wider user base with these features."
      }
    ]
  }
}
